Revit 2024 API
BuiltInFailures.RebarFailures.CoverTooLong Property
 Rebar Cover length is too large for host thickness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CoverTooLong { get; }
Visual Basic
Public Shared ReadOnly Property CoverTooLong As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CoverTooLong {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace